content/blog/mikrotik/mikrotik-securing-router-with-firewall/index.org
#+title: Mikrotik Securing Router With Firewall
#+date: 2023-07-28T12:55:34-07:00
#+draft: false

* Mikrotik Securing Router With Firewall
** Preamble
Documented are firewall rules to enable after resetting your Mikrotik
firewall. It will provide good baseline security.

* Securing the firewall
** Fresh Start
Incase you mess up or want a fresh start, run these two commands to clear all
firewall rules and address lists. Note that if you re-run the command to add a
filter, it'll either error out or duplicate if it already exists.

#+begin_src bash
/ip/firewall/filter remove [find dynamic=no]
/ip/firewall/address-list remove [find dynamic=no]
#+end_src

** Default Firewall Rules
These are the default IPv4 firewall filters suggested by Mikrotik. They work
very well and prevent unwanted connections from the WAN interface. Note that
IPv6 is disabled by default on Mikrotiks and were it to be enabled, any firewall
rules below are not configured for it.

On the line last line of the first code block, replace src-address=! with your
LAN IP range.

#+begin_src bash
/ip/firewall/filter add action=fasttrack-connection chain=forward comment=FastTrack connection-state=established,related
/ip/firewall/filter add action=accept chain=forward comment="Established, Related"  connection-state=established,related
/ip/firewall/filter add action=drop chain=forward comment="Drop invalid" connection-state=invalid log=yes log-prefix=invalid
/ip/firewall/filter add action=drop chain=forward comment="Drop tries to reach not public addresses from LAN" dst-address-list=not_in_internet in-interface=bridge1 log=yes log-prefix=!public_from_LAN out-interface=!bridge1
/ip/firewall/filter add action=drop chain=forward comment="Drop incoming packets that are not NATted" connection-nat-state=!dstnat connection-state=new in-interface=ether1 log=yes log-prefix=!NAT
/ip/firewall/filter add action=drop chain=forward comment="Drop incoming from internet which is not public IP" in-interface=ether1 log=yes log-prefix=!public src-address-list=not_in_internet
/ip/firewall/filter add action=drop chain=forward comment="Drop packets from LAN that do not have LAN IP" in-interface=bridge1 log=yes log-prefix=LAN_!LAN src-address=!192.168.1.0/24

/ip/firewall/address-list add address=0.0.0.0/8 comment=RFC6890 list=not_in_internet
/ip/firewall/address-list add address=172.16.0.0/12 comment=RFC6890 list=not_in_internet
/ip/firewall/address-list add address=192.168.0.0/16 comment=RFC6890 list=not_in_internet
/ip/firewall/address-list add address=10.0.0.0/8 comment=RFC6890 list=not_in_internet
/ip/firewall/address-list add address=169.254.0.0/16 comment=RFC6890 list=not_in_internet
/ip/firewall/address-list add address=127.0.0.0/8 comment=RFC6890 list=not_in_internet
/ip/firewall/address-list add address=224.0.0.0/4 comment=Multicast list=not_in_internet
/ip/firewall/address-list add address=198.18.0.0/15 comment=RFC6890 list=not_in_internet
/ip/firewall/address-list add address=192.0.0.0/24 comment=RFC6890 list=not_in_internet
/ip/firewall/address-list add address=192.0.2.0/24 comment=RFC6890 list=not_in_internet
/ip/firewall/address-list add address=198.51.100.0/24 comment=RFC6890 list=not_in_internet
/ip/firewall/address-list add address=203.0.113.0/24 comment=RFC6890 list=not_in_internet
/ip/firewall/address-list add address=100.64.0.0/10 comment=RFC6890 list=not_in_internet
/ip/firewall/address-list add address=240.0.0.0/4 comment=RFC6890 list=not_in_internet
/ip/firewall/address-list add address=192.88.99.0/24 comment="6to4 relay Anycast [RFC 3068]" list=not_in_internet
#+end_src

