public/blog/mikrotik/mikrotik-securing-router-with-firewall/index.html
<!DOCTYPE html>
<html lang="en">
<head>  <meta charset="UTF-8">
  <title>Mikrotik Securing Router With Firewall</title>
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <link rel="stylesheet" href="/css/gtd.css">
  
  
</head>
<body>
  
<main>
  <div style="margin: 1rem;">
    <a href="/" style="
      display: inline-block;
      background-color: #eee;
      color: #333;
      padding: 0.4rem 0.8rem;
      border-radius: 6px;
      text-decoration: none;
      font-weight: bold;
      font-family: sans-serif;
      font-size: 0.9rem;
    ">
      ← Homepage
    </a>

  <h1>Mikrotik Securing Router With Firewall</h1>

  </div>
  <nav class="toc">
    <nav id="TableOfContents">
<ul>
<li><a href="#headline-1">Mikrotik Securing Router With Firewall</a>
<ul>
<li><a href="#headline-2">Preamble</a>
</li>
</ul>
</li>
<li><a href="#headline-3">Securing the firewall</a>
<ul>
<li><a href="#headline-4">Fresh Start</a>
</li>
<li><a href="#headline-5">Default Firewall Rules</a>
</li>
<li><a href="#headline-6">Creating a Secure User Account</a>
</li>
<li><a href="#headline-7">Changing SSH/Winbox Ports</a>
</li>
<li><a href="#headline-8">Preventing Brute Force</a>
<ul>
<li><a href="#headline-9">Whitelisting a Trusted Host</a>
</li>
<li><a href="#headline-10">Preventing SSH Brute Force</a>
</li>
<li><a href="#headline-11">Preventing WinBox Brute Force</a>
</li>
</ul>
</li>
<li><a href="#headline-12">Disabling Access Via MAC Address</a>
</li>
<li><a href="#headline-13">Disabling Services</a>
<ul>
<li><a href="#headline-14">Login Services</a>
</li>
<li><a href="#headline-15">Miscellenous Services</a>
</li>
<li><a href="#headline-16">Disabling DNS cache</a>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</nav>
  </nav> 

  <article>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Mikrotik Securing Router With Firewall
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<div id="outline-container-headline-2" class="outline-3">
<h3 id="headline-2">
Preamble
</h3>
<div id="outline-text-headline-2" class="outline-text-3">
<p>Documented are firewall rules to enable after resetting your Mikrotik
firewall. It will provide good baseline security.</p>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
Securing the firewall
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<div id="outline-container-headline-4" class="outline-3">
<h3 id="headline-4">
Fresh Start
</h3>
<div id="outline-text-headline-4" class="outline-text-3">
<p>Incase you mess up or want a fresh start, run these two commands to clear all
firewall rules and address lists. Note that if you re-run the command to add a
filter, it&#39;ll either error out or duplicate if it already exists.</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>/ip/firewall/filter remove <span style="color:#f92672">[</span>find dynamic<span style="color:#f92672">=</span>no<span style="color:#f92672">]</span>
</span></span><span style="display:flex;"><span>/ip/firewall/address-list remove <span style="color:#f92672">[</span>find dynamic<span style="color:#f92672">=</span>no<span style="color:#f92672">]</span></span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-5" class="outline-3">
<h3 id="headline-5">
Default Firewall Rules
</h3>
<div id="outline-text-headline-5" class="outline-text-3">
<p>These are the default IPv4 firewall filters suggested by Mikrotik. They work
very well and prevent unwanted connections from the WAN interface. Note that
IPv6 is disabled by default on Mikrotiks and were it to be enabled, any firewall
rules below are not configured for it.</p>
<p>
On the line last line of the first code block, replace src-address=! with your
LAN IP range.</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>/ip/firewall/filter add action<span style="color:#f92672">=</span>fasttrack-connection chain<span style="color:#f92672">=</span>forward comment<span style="color:#f92672">=</span>FastTrack connection-state<span style="color:#f92672">=</span>established,related
</span></span><span style="display:flex;"><span>/ip/firewall/filter add action<span style="color:#f92672">=</span>accept chain<span style="color:#f92672">=</span>forward comment<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;Established, Related&#34;</span>  connection-state<span style="color:#f92672">=</span>established,related
</span></span><span style="display:flex;"><span>/ip/firewall/filter add action<span style="color:#f92672">=</span>drop chain<span style="color:#f92672">=</span>forward comment<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;Drop invalid&#34;</span> connection-state<span style="color:#f92672">=</span>invalid log<span style="color:#f92672">=</span>yes log-prefix<span style="color:#f92672">=</span>invalid
</span></span><span style="display:flex;"><span>/ip/firewall/filter add action<span style="color:#f92672">=</span>drop chain<span style="color:#f92672">=</span>forward comment<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;Drop tries to reach not public addresses from LAN&#34;</span> dst-address-list<span style="color:#f92672">=</span>not_in_internet in-interface<span style="color:#f92672">=</span>bridge1 log<span style="color:#f92672">=</span>yes log-prefix<span style="color:#f92672">=</span>!public_from_LAN out-interface<span style="color:#f92672">=</span>!bridge1
</span></span><span style="display:flex;"><span>/ip/firewall/filter add action<span style="color:#f92672">=</span>drop chain<span style="color:#f92672">=</span>forward comment<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;Drop incoming packets that are not NATted&#34;</span> connection-nat-state<span style="color:#f92672">=</span>!dstnat connection-state<span style="color:#f92672">=</span>new in-interface<span style="color:#f92672">=</span>ether1 log<span style="color:#f92672">=</span>yes log-prefix<span style="color:#f92672">=</span>!NAT
</span></span><span style="display:flex;"><span>/ip/firewall/filter add action<span style="color:#f92672">=</span>drop chain<span style="color:#f92672">=</span>forward comment<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;Drop incoming from internet which is not public IP&#34;</span> in-interface<span style="color:#f92672">=</span>ether1 log<span style="color:#f92672">=</span>yes log-prefix<span style="color:#f92672">=</span>!public src-address-list<span style="color:#f92672">=</span>not_in_internet
</span></span><span style="display:flex;"><span>/ip/firewall/filter add action<span style="color:#f92672">=</span>drop chain<span style="color:#f92672">=</span>forward comment<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;Drop packets from LAN that do not have LAN IP&#34;</span> in-interface<span style="color:#f92672">=</span>bridge1 log<span style="color:#f92672">=</span>yes log-prefix<span style="color:#f92672">=</span>LAN_!LAN src-address<span style="color:#f92672">=</span>!192.168.1.0/24
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>/ip/firewall/address-list add address<span style="color:#f92672">=</span>0.0.0.0/8 comment<span style="color:#f92672">=</span>RFC6890 list<span style="color:#f92672">=</span>not_in_internet
</span></span><span style="display:flex;"><span>/ip/firewall/address-list add address<span style="color:#f92672">=</span>172.16.0.0/12 comment<span style="color:#f92672">=</span>RFC6890 list<span style="color:#f92672">=</span>not_in_internet
</span></span><span style="display:flex;"><span>/ip/firewall/address-list add address<span style="color:#f92672">=</span>192.168.0.0/16 comment<span style="color:#f92672">=</span>RFC6890 list<span style="color:#f92672">=</span>not_in_internet
</span></span><span style="display:flex;"><span>/ip/firewall/address-list add address<span style="color:#f92672">=</span>10.0.0.0/8 comment<span style="color:#f92672">=</span>RFC6890 list<span style="color:#f92672">=</span>not_in_internet
</span></span><span style="display:flex;"><span>/ip/firewall/address-list add address<span style="color:#f92672">=</span>169.254.0.0/16 comment<span style="color:#f92672">=</span>RFC6890 list<span style="color:#f92672">=</span>not_in_internet
</span></span><span style="display:flex;"><span>/ip/firewall/address-list add address<span style="color:#f92672">=</span>127.0.0.0/8 comment<span style="color:#f92672">=</span>RFC6890 list<span style="color:#f92672">=</span>not_in_internet
</span></span><span style="display:flex;"><span>/ip/firewall/address-list add address<span style="color:#f92672">=</span>224.0.0.0/4 comment<span style="color:#f92672">=</span>Multicast list<span style="color:#f92672">=</span>not_in_internet
</span></span><span style="display:flex;"><span>/ip/firewall/address-list add address<span style="color:#f92672">=</span>198.18.0.0/15 comment<span style="color:#f92672">=</span>RFC6890 list<span style="color:#f92672">=</span>not_in_internet
</span></span><span style="display:flex;"><span>/ip/firewall/address-list add address<span style="color:#f92672">=</span>192.0.0.0/24 comment<span style="color:#f92672">=</span>RFC6890 list<span style="color:#f92672">=</span>not_in_internet
</span></span><span style="display:flex;"><span>/ip/firewall/address-list add address<span style="color:#f92672">=</span>192.0.2.0/24 comment<span style="color:#f92672">=</span>RFC6890 list<span style="color:#f92672">=</span>not_in_internet
</span></span><span style="display:flex;"><span>/ip/firewall/address-list add address<span style="color:#f92672">=</span>198.51.100.0/24 comment<span style="color:#f92672">=</span>RFC6890 list<span style="color:#f92672">=</span>not_in_internet
</span></span><span style="display:flex;"><span>/ip/firewall/address-list add address<span style="color:#f92672">=</span>203.0.113.0/24 comment<span style="color:#f92672">=</span>RFC6890 list<span style="color:#f92672">=</span>not_in_internet
</span></span><span style="display:flex;"><span>/ip/firewall/address-list add address<span style="color:#f92672">=</span>100.64.0.0/10 comment<span style="color:#f92672">=</span>RFC6890 list<span style="color:#f92672">=</span>not_in_internet
</span></span><span style="display:flex;"><span>/ip/firewall/address-list add address<span style="color:#f92672">=</span>240.0.0.0/4 comment<span style="color:#f92672">=</span>RFC6890 list<span style="color:#f92672">=</span>not_in_internet
</span></span><span style="display:flex;"><span>/ip/firewall/address-list add address<span style="color:#f92672">=</span>192.88.99.0/24 comment<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;6to4 relay Anycast [RFC 3068]&#34;</span> list<span style="color:#f92672">=</span>not_in_internet</span></span></code></pre></div>
</div>
</div>
</div>
