content/blog/mikrotik/mikrotik-securing-router-with-firewall/index.org
** Creating a Secure User Account
Here we'll create a new administrative user and delete the default admin account. The username should be unique to prevent dictionary attacks.

#+begin_src bash
/user add name=SECURE_USER_NAME password=SUPER_SECURE_PASSWORD group=full
/user remove admin
#+end_src

Afterward, we can set WinBox to only allow the user to login on a specific subnet.

#+begin_src bash
/user set USERNAME address=192.168.1.0/24
#+end_src

** Changing SSH/Winbox Ports
Here we'll change the default SSH port to 1950 and the default Winbox port to 1951

#+begin_src bash
/ip/service/set ssh port=1950
/ip/service/set winbox port=1951
#+end_src

** Preventing Brute Force
*** Whitelisting a Trusted Host
To prevent accidental lockouts caused by the firewall filters we're about to create, whitelist your server IP address by running the following commands. This will create an IP Address list called TRUSTED, then add a firewall filter to always accept traffic.

#+begin_src bash
# Our SERVER IP Address that get's whitlisted
/ip/firewall/address-list add address=192.168.1.10 disabled=no list=TRUSTED

# Creating a rule at INDEX 0 to always allow traffic from TRUSTED list
/ip/firewall/filter add chain=input action=accept connection-state=new src-address-list=TRUSTED place-before=0 comment="Allow Trusted"
/ip/firewall/filter add chain=input action=accept connection-state=new src-address-list=TRUSTED comment="Allow Trusted"
Prevent FTP Brute Force
After 3 failed login attempts, block the IP from using FTP for 20 minutes

/ip/firewall/filter add chain=input protocol=tcp dst-port=21 src-address-list=ftp_blacklist action=drop \
            comment="drop ftp brute forcers" disabled=no

/ip/firewall/filter add chain=input protocol=tcp dst-port=21 connection-state=new \
            src-address-list=ftp_stage3 action=add-src-to-address-list address-list=ftp_blacklist \
            address-list-timeout=20m comment="" disabled=no

/ip/firewall/filter add chain=input protocol=tcp dst-port=21 connection-state=new \
            src-address-list=ftp_stage2 action=add-src-to-address-list address-list=ftp_stage3 \
            address-list-timeout=1m comment="" disabled=no

/ip/firewall/filter add chain=input protocol=tcp dst-port=21 connection-state=new src-address-list=ftp_stage1 \
            action=add-src-to-address-list address-list=ftp_stage2 address-list-timeout=1m comment="" disabled=no

/ip/firewall/filter add chain=input protocol=tcp dst-port=21 connection-state=new action=add-src-to-address-list \
            address-list=ftp_stage1 address-list-timeout=1m comment="" disabled=no
#+end_src

