public/blog/mikrotik/mikrotik-securing-router-with-firewall/index.html
<div id="outline-container-headline-6" class="outline-3">
<h3 id="headline-6">
Creating a Secure User Account
</h3>
<div id="outline-text-headline-6" class="outline-text-3">
<p>Here we&#39;ll create a new administrative user and delete the default admin account. The username should be unique to prevent dictionary attacks.</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>/user add name<span style="color:#f92672">=</span>SECURE_USER_NAME password<span style="color:#f92672">=</span>SUPER_SECURE_PASSWORD group<span style="color:#f92672">=</span>full
</span></span><span style="display:flex;"><span>/user remove admin</span></span></code></pre></div>
</div>
<p>
Afterward, we can set WinBox to only allow the user to login on a specific subnet.</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>/user set USERNAME address<span style="color:#f92672">=</span>192.168.1.0/24</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-7" class="outline-3">
<h3 id="headline-7">
Changing SSH/Winbox Ports
</h3>
<div id="outline-text-headline-7" class="outline-text-3">
<p>Here we&#39;ll change the default SSH port to 1950 and the default Winbox port to 1951</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>/ip/service/set ssh port<span style="color:#f92672">=</span><span style="color:#ae81ff">1950</span>
</span></span><span style="display:flex;"><span>/ip/service/set winbox port<span style="color:#f92672">=</span><span style="color:#ae81ff">1951</span></span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-8" class="outline-3">
<h3 id="headline-8">
Preventing Brute Force
</h3>
<div id="outline-text-headline-8" class="outline-text-3">
<div id="outline-container-headline-9" class="outline-4">
<h4 id="headline-9">
Whitelisting a Trusted Host
</h4>
<div id="outline-text-headline-9" class="outline-text-4">
<p>To prevent accidental lockouts caused by the firewall filters we&#39;re about to create, whitelist your server IP address by running the following commands. This will create an IP Address list called TRUSTED, then add a firewall filter to always accept traffic.</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span><span style="color:#75715e"># Our SERVER IP Address that get&#39;s whitlisted</span>
</span></span><span style="display:flex;"><span>/ip/firewall/address-list add address<span style="color:#f92672">=</span>192.168.1.10 disabled<span style="color:#f92672">=</span>no list<span style="color:#f92672">=</span>TRUSTED
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span><span style="color:#75715e"># Creating a rule at INDEX 0 to always allow traffic from TRUSTED list</span>
</span></span><span style="display:flex;"><span>/ip/firewall/filter add chain<span style="color:#f92672">=</span>input action<span style="color:#f92672">=</span>accept connection-state<span style="color:#f92672">=</span>new src-address-list<span style="color:#f92672">=</span>TRUSTED place-before<span style="color:#f92672">=</span><span style="color:#ae81ff">0</span> comment<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;Allow Trusted&#34;</span>
</span></span><span style="display:flex;"><span>/ip/firewall/filter add chain<span style="color:#f92672">=</span>input action<span style="color:#f92672">=</span>accept connection-state<span style="color:#f92672">=</span>new src-address-list<span style="color:#f92672">=</span>TRUSTED comment<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;Allow Trusted&#34;</span>
</span></span><span style="display:flex;"><span>Prevent FTP Brute Force
</span></span><span style="display:flex;"><span>After <span style="color:#ae81ff">3</span> failed login attempts, block the IP from using FTP <span style="color:#66d9ef">for</span> <span style="color:#ae81ff">20</span> minutes
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>/ip/firewall/filter add chain<span style="color:#f92672">=</span>input protocol<span style="color:#f92672">=</span>tcp dst-port<span style="color:#f92672">=</span><span style="color:#ae81ff">21</span> src-address-list<span style="color:#f92672">=</span>ftp_blacklist action<span style="color:#f92672">=</span>drop <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>            comment<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;drop ftp brute forcers&#34;</span> disabled<span style="color:#f92672">=</span>no
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>/ip/firewall/filter add chain<span style="color:#f92672">=</span>input protocol<span style="color:#f92672">=</span>tcp dst-port<span style="color:#f92672">=</span><span style="color:#ae81ff">21</span> connection-state<span style="color:#f92672">=</span>new <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>            src-address-list<span style="color:#f92672">=</span>ftp_stage3 action<span style="color:#f92672">=</span>add-src-to-address-list address-list<span style="color:#f92672">=</span>ftp_blacklist <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>            address-list-timeout<span style="color:#f92672">=</span>20m comment<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;&#34;</span> disabled<span style="color:#f92672">=</span>no
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>/ip/firewall/filter add chain<span style="color:#f92672">=</span>input protocol<span style="color:#f92672">=</span>tcp dst-port<span style="color:#f92672">=</span><span style="color:#ae81ff">21</span> connection-state<span style="color:#f92672">=</span>new <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>            src-address-list<span style="color:#f92672">=</span>ftp_stage2 action<span style="color:#f92672">=</span>add-src-to-address-list address-list<span style="color:#f92672">=</span>ftp_stage3 <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>            address-list-timeout<span style="color:#f92672">=</span>1m comment<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;&#34;</span> disabled<span style="color:#f92672">=</span>no
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>/ip/firewall/filter add chain<span style="color:#f92672">=</span>input protocol<span style="color:#f92672">=</span>tcp dst-port<span style="color:#f92672">=</span><span style="color:#ae81ff">21</span> connection-state<span style="color:#f92672">=</span>new src-address-list<span style="color:#f92672">=</span>ftp_stage1 <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>            action<span style="color:#f92672">=</span>add-src-to-address-list address-list<span style="color:#f92672">=</span>ftp_stage2 address-list-timeout<span style="color:#f92672">=</span>1m comment<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;&#34;</span> disabled<span style="color:#f92672">=</span>no
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>/ip/firewall/filter add chain<span style="color:#f92672">=</span>input protocol<span style="color:#f92672">=</span>tcp dst-port<span style="color:#f92672">=</span><span style="color:#ae81ff">21</span> connection-state<span style="color:#f92672">=</span>new action<span style="color:#f92672">=</span>add-src-to-address-list <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>            address-list<span style="color:#f92672">=</span>ftp_stage1 address-list-timeout<span style="color:#f92672">=</span>1m comment<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;&#34;</span> disabled<span style="color:#f92672">=</span>no</span></span></code></pre></div>
</div>
</div>
</div>
