content/blog/mikrotik/mikrotik-securing-router-with-firewall/index.org
*** Preventing SSH Brute Force

#+begin_src bash
/ip/firewall/filter add chain=input protocol=tcp dst-port=1950 src-address-list=ssh_blacklist action=drop \
            comment="drop ssh brute forcers" disabled=no

/ip/firewall/filter add chain=input protocol=tcp dst-port=1950 connection-state=new \
            src-address-list=ssh_stage3 action=add-src-to-address-list address-list=ssh_blacklist \
            address-list-timeout=20m comment="" disabled=no

/ip/firewall/filter add chain=input protocol=tcp dst-port=1950 connection-state=new \
            src-address-list=ssh_stage2 action=add-src-to-address-list address-list=ssh_stage3 \
            address-list-timeout=1m comment="" disabled=no

/ip/firewall/filter add chain=input protocol=tcp dst-port=1950 connection-state=new src-address-list=ssh_stage1 \
            action=add-src-to-address-list address-list=ssh_stage2 address-list-timeout=1m comment="" disabled=no

/ip/firewall/filter add chain=input protocol=tcp dst-port=1950 connection-state=new action=add-src-to-address-list \
            address-list=ssh_stage1 address-list-timeout=1m comment="" disabled=no
#+end_src

*** Preventing WinBox Brute Force
After 3 failed login attempts, block the IP from using Winboxfor 20 minutes

#+begin_src bash
/ip/firewall/filter add chain=input protocol=tcp dst-port=1951 src-address-list=winbox_blacklist action=drop \
            comment="drop winbox brute forcers" disabled=no

/ip/firewall/filter add chain=input protocol=tcp dst-port=1951 connection-state=new \
            src-address-list=winbox_stage3 action=add-src-to-address-list address-list=winbox_blacklist \
            address-list-timeout=20m comment="" disabled=no

/ip/firewall/filter add chain=input protocol=tcp dst-port=1951 connection-state=new \
            src-address-list=winbox_stage2 action=add-src-to-address-list address-list=winbox_stage3 \
            address-list-timeout=1m comment="" disabled=no

/ip/firewall/filter add chain=input protocol=tcp dst-port=1951 connection-state=new src-address-list=winbox_stage1 \
            action=add-src-to-address-list address-list=winbox_stage2 address-list-timeout=1m comment="" disabled=no

/ip/firewall/filter add chain=input protocol=tcp dst-port=1951 connection-state=new action=add-src-to-address-list \
            address-list=winbox_stage1 address-list-timeout=1m comment="" disabled=no
#+end_src

** Disabling Access Via MAC Address
Here we'll disable any form of login using the Mac Address rather than IP address.

#+begin_src bash
/tool/mac-server set allowed-interface-list=none
/tool/mac-server print
/tool/mac-server mac-winbox set allowed-interface-list=none
/tool/mac-server mac-winbox print
/tool/mac-server ping set enabled=no
/tool/mac-server ping print
/ip neighbor discovery-settings set discover-interface-list=none
#+end_src

** Disabling Services
*** Login Services
We only want SSH and WinBox services enabled. Here we'll disable everything except those

#+begin_src bash
/ip/service disable telnet,ftp,www,api,api-ssl
/ip/service print
#+end_src

