public/blog/mikrotik/mikrotik-securing-router-with-firewall/index.html
<div id="outline-container-headline-10" class="outline-4">
<h4 id="headline-10">
Preventing SSH Brute Force
</h4>
<div id="outline-text-headline-10" class="outline-text-4">
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>/ip/firewall/filter add chain<span style="color:#f92672">=</span>input protocol<span style="color:#f92672">=</span>tcp dst-port<span style="color:#f92672">=</span><span style="color:#ae81ff">1950</span> src-address-list<span style="color:#f92672">=</span>ssh_blacklist action<span style="color:#f92672">=</span>drop <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>            comment<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;drop ssh brute forcers&#34;</span> disabled<span style="color:#f92672">=</span>no
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>/ip/firewall/filter add chain<span style="color:#f92672">=</span>input protocol<span style="color:#f92672">=</span>tcp dst-port<span style="color:#f92672">=</span><span style="color:#ae81ff">1950</span> connection-state<span style="color:#f92672">=</span>new <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>            src-address-list<span style="color:#f92672">=</span>ssh_stage3 action<span style="color:#f92672">=</span>add-src-to-address-list address-list<span style="color:#f92672">=</span>ssh_blacklist <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>            address-list-timeout<span style="color:#f92672">=</span>20m comment<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;&#34;</span> disabled<span style="color:#f92672">=</span>no
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>/ip/firewall/filter add chain<span style="color:#f92672">=</span>input protocol<span style="color:#f92672">=</span>tcp dst-port<span style="color:#f92672">=</span><span style="color:#ae81ff">1950</span> connection-state<span style="color:#f92672">=</span>new <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>            src-address-list<span style="color:#f92672">=</span>ssh_stage2 action<span style="color:#f92672">=</span>add-src-to-address-list address-list<span style="color:#f92672">=</span>ssh_stage3 <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>            address-list-timeout<span style="color:#f92672">=</span>1m comment<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;&#34;</span> disabled<span style="color:#f92672">=</span>no
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>/ip/firewall/filter add chain<span style="color:#f92672">=</span>input protocol<span style="color:#f92672">=</span>tcp dst-port<span style="color:#f92672">=</span><span style="color:#ae81ff">1950</span> connection-state<span style="color:#f92672">=</span>new src-address-list<span style="color:#f92672">=</span>ssh_stage1 <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>            action<span style="color:#f92672">=</span>add-src-to-address-list address-list<span style="color:#f92672">=</span>ssh_stage2 address-list-timeout<span style="color:#f92672">=</span>1m comment<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;&#34;</span> disabled<span style="color:#f92672">=</span>no
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>/ip/firewall/filter add chain<span style="color:#f92672">=</span>input protocol<span style="color:#f92672">=</span>tcp dst-port<span style="color:#f92672">=</span><span style="color:#ae81ff">1950</span> connection-state<span style="color:#f92672">=</span>new action<span style="color:#f92672">=</span>add-src-to-address-list <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>            address-list<span style="color:#f92672">=</span>ssh_stage1 address-list-timeout<span style="color:#f92672">=</span>1m comment<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;&#34;</span> disabled<span style="color:#f92672">=</span>no</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-11" class="outline-4">
<h4 id="headline-11">
Preventing WinBox Brute Force
</h4>
<div id="outline-text-headline-11" class="outline-text-4">
<p>After 3 failed login attempts, block the IP from using Winboxfor 20 minutes</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>/ip/firewall/filter add chain<span style="color:#f92672">=</span>input protocol<span style="color:#f92672">=</span>tcp dst-port<span style="color:#f92672">=</span><span style="color:#ae81ff">1951</span> src-address-list<span style="color:#f92672">=</span>winbox_blacklist action<span style="color:#f92672">=</span>drop <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>            comment<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;drop winbox brute forcers&#34;</span> disabled<span style="color:#f92672">=</span>no
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>/ip/firewall/filter add chain<span style="color:#f92672">=</span>input protocol<span style="color:#f92672">=</span>tcp dst-port<span style="color:#f92672">=</span><span style="color:#ae81ff">1951</span> connection-state<span style="color:#f92672">=</span>new <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>            src-address-list<span style="color:#f92672">=</span>winbox_stage3 action<span style="color:#f92672">=</span>add-src-to-address-list address-list<span style="color:#f92672">=</span>winbox_blacklist <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>            address-list-timeout<span style="color:#f92672">=</span>20m comment<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;&#34;</span> disabled<span style="color:#f92672">=</span>no
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>/ip/firewall/filter add chain<span style="color:#f92672">=</span>input protocol<span style="color:#f92672">=</span>tcp dst-port<span style="color:#f92672">=</span><span style="color:#ae81ff">1951</span> connection-state<span style="color:#f92672">=</span>new <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>            src-address-list<span style="color:#f92672">=</span>winbox_stage2 action<span style="color:#f92672">=</span>add-src-to-address-list address-list<span style="color:#f92672">=</span>winbox_stage3 <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>            address-list-timeout<span style="color:#f92672">=</span>1m comment<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;&#34;</span> disabled<span style="color:#f92672">=</span>no
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>/ip/firewall/filter add chain<span style="color:#f92672">=</span>input protocol<span style="color:#f92672">=</span>tcp dst-port<span style="color:#f92672">=</span><span style="color:#ae81ff">1951</span> connection-state<span style="color:#f92672">=</span>new src-address-list<span style="color:#f92672">=</span>winbox_stage1 <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>            action<span style="color:#f92672">=</span>add-src-to-address-list address-list<span style="color:#f92672">=</span>winbox_stage2 address-list-timeout<span style="color:#f92672">=</span>1m comment<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;&#34;</span> disabled<span style="color:#f92672">=</span>no
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>/ip/firewall/filter add chain<span style="color:#f92672">=</span>input protocol<span style="color:#f92672">=</span>tcp dst-port<span style="color:#f92672">=</span><span style="color:#ae81ff">1951</span> connection-state<span style="color:#f92672">=</span>new action<span style="color:#f92672">=</span>add-src-to-address-list <span style="color:#ae81ff">\
</span></span></span><span style="display:flex;"><span><span style="color:#ae81ff"></span>            address-list<span style="color:#f92672">=</span>winbox_stage1 address-list-timeout<span style="color:#f92672">=</span>1m comment<span style="color:#f92672">=</span><span style="color:#e6db74">&#34;&#34;</span> disabled<span style="color:#f92672">=</span>no</span></span></code></pre></div>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-headline-12" class="outline-3">
<h3 id="headline-12">
Disabling Access Via MAC Address
</h3>
<div id="outline-text-headline-12" class="outline-text-3">
<p>Here we&#39;ll disable any form of login using the Mac Address rather than IP address.</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>/tool/mac-server set allowed-interface-list<span style="color:#f92672">=</span>none
</span></span><span style="display:flex;"><span>/tool/mac-server print
</span></span><span style="display:flex;"><span>/tool/mac-server mac-winbox set allowed-interface-list<span style="color:#f92672">=</span>none
</span></span><span style="display:flex;"><span>/tool/mac-server mac-winbox print
</span></span><span style="display:flex;"><span>/tool/mac-server ping set enabled<span style="color:#f92672">=</span>no
</span></span><span style="display:flex;"><span>/tool/mac-server ping print
</span></span><span style="display:flex;"><span>/ip neighbor discovery-settings set discover-interface-list<span style="color:#f92672">=</span>none</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-13" class="outline-3">
<h3 id="headline-13">
Disabling Services
</h3>
<div id="outline-text-headline-13" class="outline-text-3">
<div id="outline-container-headline-14" class="outline-4">
<h4 id="headline-14">
Login Services
</h4>
<div id="outline-text-headline-14" class="outline-text-4">
<p>We only want SSH and WinBox services enabled. Here we&#39;ll disable everything except those</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>/ip/service disable telnet,ftp,www,api,api-ssl
</span></span><span style="display:flex;"><span>/ip/service print</span></span></code></pre></div>
</div>
</div>
</div>
