content/blog/mikrotik/mikrotik-securing-router-with-firewall/index.org
*** Miscellenous Services
These services should already be disabled, but let's do it explicitly.

#+begin_src bash
# Disable Proxy Caching
/ip/proxy set enabled=no

# Disable Socks Proxy
/ip/socks set enabled=no

# Disable UPNP
/ip/upnp set enabled=no
/tool/bandwidth-server set enabled=no
#+end_src

*** Disabling DNS cache
The router will cache DNS records by default. To avoid this causing any potential issues anything, we'll disable it

#+begin_src bash
/ip/dns set allow-remote-requests=no
#+end_src
