public/blog/mikrotik/mikrotik-securing-router-with-firewall/index.html
<div id="outline-container-headline-15" class="outline-4">
<h4 id="headline-15">
Miscellenous Services
</h4>
<div id="outline-text-headline-15" class="outline-text-4">
<p>These services should already be disabled, but let&#39;s do it explicitly.</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span><span style="color:#75715e"># Disable Proxy Caching</span>
</span></span><span style="display:flex;"><span>/ip/proxy set enabled<span style="color:#f92672">=</span>no
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span><span style="color:#75715e"># Disable Socks Proxy</span>
</span></span><span style="display:flex;"><span>/ip/socks set enabled<span style="color:#f92672">=</span>no
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span><span style="color:#75715e"># Disable UPNP</span>
</span></span><span style="display:flex;"><span>/ip/upnp set enabled<span style="color:#f92672">=</span>no
</span></span><span style="display:flex;"><span>/tool/bandwidth-server set enabled<span style="color:#f92672">=</span>no</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-16" class="outline-4">
<h4 id="headline-16">
Disabling DNS cache
</h4>
<div id="outline-text-headline-16" class="outline-text-4">
<p>The router will cache DNS records by default. To avoid this causing any potential issues anything, we&#39;ll disable it</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>/ip/dns set allow-remote-requests<span style="color:#f92672">=</span>no</span></span></code></pre></div>
</div>
</div>
</div>
</div>
</div>
</div>
</div>

  </article>
</main>

</body>
</html>
